package stepic.baseSyntax.Lesson1_1.Step9;

/*
    Программировать - это легко!
Выведите на экран фразу "Программировать - это легко! " 5 раз,  каждый раз через пробел.

Sample Input:

Sample Output:

Программировать - это легко! Программировать - это легко! Программировать - это легко! Программировать - это легко! Программировать - это легко!
 */

public class Main {
    public static void main(String[] args) {
        System.out.printf("%1$s %1$s %1$s %1$s %1$s", "Программировать - это легко!");
    }
}
