package stepic.baseSyntax.Lesson1_1.Step8;

/*
    Программировать - это легко!
Выведите на экран фразу "Программировать - это легко! " 3 раза, каждый раз с новой строки.

Sample Input:

Sample Output:

Программировать - это легко!
Программировать - это легко!
Программировать - это легко!
 */

public class Main {
    public static void main(String[] args) {
        System.out.println("Программировать - это легко!");
        System.out.println("Программировать - это легко!");
        System.out.println("Программировать - это легко!");

    }
}
